Merge pull request #3 from devanbenz/feat/init
feat: working on it
