--- a/README.md
+++ b/README.md
@@ -1,60 +1,69 @@
+
 ## Communication Architecture
 
-```mermaid
-graph TB
-    subgraph Clients
-        C1[Client 1]
-        C2[Client 2]
-        C3[Client 3]
-    end
+```
+           Clients 
+   (python or http client)                       
+    ┌─────┐┌─────┐┌─────┐                 
+    │     ││     ││     │                 
+    │     ││     ││     │                 
+    └──┬──┘└──┬──┘└──┬──┘                 
+┌──────┼──────┼──────┼───────────────────┐
+│  ┌───▼──────▼──────▼────────────────┐  │
+│  │           CONTROL PLANE          │  │
+│  │            API SERVER            │  │
+│  └──────┬────────────────────┬──────┘  │
+│         │                    │         │
+│  ┌──────▼───────┐     ┌──────▼──────┐  │
+│  │              │     │             │  │
+│  │   KV STORE   │     │             │  │
+│  │              │     │             │  │
+│  └──────┬───────┘     │    OBJECT   │  │
+│         │             │    STORE    │  │
+│  ┌──────▼───────┐     │             │  │
+│  │              │     │             │  │
+│  │  SCHEDULER   │     │             │  │
+│  │              │     │             │  │
+│  └──┬───────────┘     └─────┬───────┘  │
+│     │                       │          │
+└─────┼───────────────────────┼──────────┘
+      │-RPC                   │           
+   ┌──▼────────────┐          │           
+   │┌───────────────┐         │           
+   ││ ┌───────────────┐       │           
+   ││ │               │       │           
+   ││ │               │       │           
+   ││ │ WORKER NODES  ◄───────┘           
+   └│ │               │                   
+    └─│               │                   
+      └───────────────┘                   
 
-    subgraph Control Plane TB
-        API[API Server]
-        TS[Task Scheduler]
-        KV[(Key-Value Store)]
-        
-        API --> TS
-        TS --> KV
-    end
-
-    subgraph Worker Nodes
-        direction TB
-        subgraph "Partition 1"
-            W1[Worker 1]
-            W2[Worker 2]
-        end
-        
-        subgraph "Partition 2"
-            W3[Worker 3]
-            W4[Worker 4]
-        end
-        
-        subgraph "Partition N"
-            W5[Worker 5]
-            W6[Worker 6]
-        end
-    end
-
-    C1 -->|TCP| API
-    C2 -->|TCP| API
-    C3 -->|TCP| API
-    
-    direction TB
-    TS -->|gRPC| W1
-    TS -->|gRPC| W2
-    TS -->|gRPC| W3
-    TS -->|gRPC| W4
-    TS -->|gRPC| W5
-    TS -->|gRPC| W6
 ```
 
 ## Specifications
-* Master and Worker nodes that can run across machine boundaries or locally that can communicate via TCP.
